### pandas入门

In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

### Series
Series是一种类似于一维数组的对象，它由一组数据（各种Numpy数据类型）以及一组与之相关的数据标签（索引）组成。

In [2]:
obj = pd.Series([4, 7, -5, 3])
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [3]:
obj.values
obj.index  # like range(4)

RangeIndex(start=0, stop=4, step=1)

In [4]:
# 为数据点创建带有标记的索引
obj2 = pd.Series([4, 7, -5, 3], index=['d', 'b', 'a', 'c'])
obj2
obj2.index

Index(['d', 'b', 'a', 'c'], dtype='object')

In [5]:
# 可以通过索引来访问数据
obj2['a']
obj2['d'] = 6
obj2[['c', 'a', 'd']]

c    3
a   -5
d    6
dtype: int64

In [6]:
# 进行运算也会保留索引的标记
obj2[obj2 > 0]
obj2 * 2
np.exp(obj2)

d     403.428793
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

In [7]:
# 可以将Series看成一个定长的有序字典，很多使用很多字典的方法
'b' in obj2
'e' in obj2

False

In [8]:
# 直接通过字典创建Series，索引为字典键的有序排列
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}
obj3 = pd.Series(sdata)
obj3

Ohio      35000
Oregon    16000
Texas     71000
Utah       5000
dtype: int64

In [9]:
# 让字典和列表中的元素对应起来，找不到的为缺失值NaN
states = ['California', 'Ohio', 'Oregon', 'Texas']
obj4 = pd.Series(sdata, index=states)
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [10]:
# 检测确实数据
pd.isnull(obj4)
pd.notnull(obj4)
obj4.isnull()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [11]:
# 会自动对齐不同索引的数据
obj3 + obj4

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [12]:
# 对象本身和索引都有name属性
obj4.name = 'population'
obj4.index.name = 'state'
obj4

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

In [13]:
# 可以直接对索引赋值
obj.index = ['Bob', 'Steve', 'Jeff', 'Ryan']
obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

### DataFrame
DataFrame是一个表格型的数据结构，它含有一组有序的列，每列可以是不同的值类型。DataFrame既有行索引也有列索引，它可以被看由Series组成的字典。

In [14]:
# 直接传入一个等长列表或Numpy数组组成的字典创建DataFrame
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
        'year': [2000, 2001, 2002, 2001, 2002, 2003],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
frame = pd.DataFrame(data)
frame.head()

   pop   state  year
0  1.5    Ohio  2000
1  1.7    Ohio  2001
2  3.6    Ohio  2002
3  2.4  Nevada  2001
4  2.9  Nevada  2002

In [15]:
# 指定索引，会按照指定索引排序
pd.DataFrame(data, columns=['year', 'state', 'pop']).head()

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9

In [16]:
# 传入的索引找不到时值为NaN
frame2 = pd.DataFrame(data, columns=['year', 'state', 'pop', 'debt'],
                      index=['one', 'two', 'three', 'four',
                             'five', 'six'])
frame2.columns
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

In [17]:
# 将DataFrame的一列获取为Series的方式
frame2['year']
frame2.year

one      2000
two      2001
three    2002
four     2001
five     2002
six      2003
Name: year, dtype: int64

In [18]:
# 使用loc获取索引的值
frame2.loc['three']

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [19]:
# 直接对DataFrame的列赋值，如果赋值对象为数组和列表时，长度要一致。
frame2['debt'] = 16.5
frame2
frame2['debt'] = np.arange(6.)
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   0.0
two    2001    Ohio  1.7   1.0
three  2002    Ohio  3.6   2.0
four   2001  Nevada  2.4   3.0
five   2002  Nevada  2.9   4.0
six    2003  Nevada  3.2   5.0

In [20]:
# 赋值为Series对象时，会精确匹配DataFrame的索引，匹配不到的填缺失值NaN
val = pd.Series([-1.2, -1.5, -1.7], index=['two', 'four', 'five'])
frame2['debt'] = val
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

In [21]:
# 为不存在的索引赋值时，会创建新的列。
frame2['eastern'] = frame2.state == 'Ohio'
frame2

       year   state  pop  debt  eastern
one    2000    Ohio  1.5   NaN     True
two    2001    Ohio  1.7  -1.2     True
three  2002    Ohio  3.6   NaN     True
four   2001  Nevada  2.4  -1.5    False
five   2002  Nevada  2.9  -1.7    False
six    2003  Nevada  3.2   NaN    False

In [22]:
# 删除列
del frame2['eastern']
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [23]:
# 传递嵌套字典，外层字典的键为列，内层键作为行索引。
pop = {'Nevada': {2001: 2.4, 2002: 2.9},
       'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}
frame3 = pd.DataFrame(pop)
# 进行转置
frame3.T
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [24]:
# 指定索引
pd.DataFrame(pop, index=[2001, 2002, 2003])

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

In [25]:
# Series组成的字典生成DataFrame，用法一样
pdata = {'Ohio': frame3['Ohio'][:-1],
         'Nevada': frame3['Nevada'][:2]}
pd.DataFrame(pdata)

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7

In [26]:
# 设置index和column的name属性
frame3.index.name = 'year'; frame3.columns.name = 'state'
frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [27]:
# 以二维ndarray的形式返回DataFrame中的数据，当数据类型不同时，会选用兼容所有列的数据类型。
frame2.values

array([[2000, 'Ohio', 1.5, nan],
       [2001, 'Ohio', 1.7, -1.2],
       [2002, 'Ohio', 3.6, nan],
       [2001, 'Nevada', 2.4, -1.5],
       [2002, 'Nevada', 2.9, -1.7],
       [2003, 'Nevada', 3.2, nan]], dtype=object)

### 索引对象
pandas的索引对象负责管理轴标签和其他元数据

In [28]:
obj = pd.Series(range(3), index=['a', 'b', 'c'])
index = obj.index
index
index[1:]

Index(['b', 'c'], dtype='object')

##### Index对象是不可修改的，对其修改会报错。
index[1] = 'd' # TypeError

In [29]:
# 不可修改才可以使Index对象在多个数据结构之间安全共享
labels = pd.Index(np.arange(3))
labels
obj2 = pd.Series([1.5, -2.5, 0], index=labels)
obj2
obj2.index is labels

True

In [30]:
# index相当于一个固定长度的集合，可以使用很多集合的方法。
frame3
frame3.columns
'Ohio' in frame3.columns
2003 in frame3.index

False

### 基本功能
介绍操作Series和DataFrame中数据的基本手段。

### 重新索引

In [31]:
obj = pd.Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [32]:
# 按照新索引重新排序
obj2 = obj.reindex(['a', 'b', 'c', 'd', 'e'])
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [33]:
obj3 = pd.Series(['blue', 'purple', 'yellow'], index=[0, 2, 4])
obj3

0      blue
2    purple
4    yellow
dtype: object

In [34]:
# 可以使用method选项的ffill方法实现值的前向后填充
obj3.reindex(range(6), method='ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [35]:
# 对于DataFrame，reindex可以修改行、列索引，或者2个都修改。当仅传递一个序列，则会重新索引行。
frame = pd.DataFrame(np.arange(9).reshape((3, 3)),
                     index=['a', 'c', 'd'],
                     columns=['Ohio', 'Texas', 'California'])
frame
frame2 = frame.reindex(['a', 'b', 'c', 'd'])
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [36]:
# 重新索引列
states = ['Texas', 'Utah', 'California']
frame.reindex(columns=states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [37]:
# 下面2种方式同时对行和列进行重新索引
frame.reindex(index=['a', 'b', 'c', 'd'], columns=states)
frame.loc[['a', 'b', 'c', 'd'], states]

   Texas  Utah  California
a    1.0   NaN         2.0
b    NaN   NaN         NaN
c    4.0   NaN         5.0
d    7.0   NaN         8.0

### 丢弃指定轴上的项

In [38]:
# drop方法返回一个指定轴上删除了指定值的新对象
obj = pd.Series(np.arange(5.), index=['a', 'b', 'c', 'd', 'e'])
obj
# 使用inplace参数，直接在原视图上直接删除
obj.drop('c', inplace=True)
new_obj = obj.drop(['d', 'b'])
new_obj

a    0.0
e    4.0
dtype: float64

In [39]:
# DataFrame，可以删除任意轴上的索引值
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                    index=['Ohio', 'Colorado', 'Utah', 'New York'],
                    columns=['one', 'two', 'three', 'four'])
data
data.drop(['Colorado', 'Ohio'])
data.drop('two', axis=1)
data.drop(['two', 'four'], axis='columns')

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

### 索引、选取和过滤

In [40]:
obj = pd.Series(np.arange(4.), index=['a', 'b', 'c', 'd'])
obj
obj['b']
obj[1]
obj[2:4]
obj[['b', 'a', 'd']]
obj[[1, 3]]
obj[obj < 2]

a    0.0
b    1.0
dtype: float64

In [41]:
# 和普通python切片不同，这里是包含末端结果
obj['b':'c']
obj['b':'c'] = 5
obj

a    0.0
b    5.0
c    5.0
d    3.0
dtype: float64

In [42]:
# 对DataFrame进行索引就是获取一个或多个列
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                    index=['Ohio', 'Colorado', 'Utah', 'New York'],
                    columns=['one', 'two', 'three', 'four'])
data
data['two']
data[['three', 'one']]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

In [43]:
# 对行的索引
data[:2]
data[data['three'] > 5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [44]:
# 通过布尔型DataFrame来进行索引，语法上和ndarray很类似。
data < 5
data[data < 5] = 0
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [45]:
# 为了在DataFrame的行上进行标签索引，可以使用loc、iloc方法选取行和列的子集。
data.loc['Colorado', ['two', 'three']]

two      5
three    6
Name: Colorado, dtype: int32

In [46]:
data.iloc[2, [3, 0, 1]]
data.iloc[2]
data.iloc[[1, 2], [3, 0, 1]]

          four  one  two
Colorado     7    0    5
Utah        11    8    9

In [47]:
data.loc[:'Utah', 'two']
data.iloc[:, :3][data.three > 5]

          one  two  three
Colorado    0    5      6
Utah        8    9     10
New York   12   13     14

### 算术运算和数据对齐

In [49]:
# 2个Series为结果的并集，找不到的填充空值NaN，没有重叠的部分为NaN值。
s1 = pd.Series([7.3, -2.5, 3.4, 1.5], index=['a', 'c', 'd', 'e'])
s2 = pd.Series([-2.1, 3.6, -1.5, 4, 3.1],
               index=['a', 'c', 'e', 'f', 'g'])
s1 + s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [50]:
# DataFrame对齐操作会同时发生在行和列上
df1 = pd.DataFrame(np.arange(9.).reshape((3, 3)), columns=list('bcd'),
                   index=['Ohio', 'Texas', 'Colorado'])
df2 = pd.DataFrame(np.arange(12.).reshape((4, 3)), columns=list('bde'),
                   index=['Utah', 'Ohio', 'Texas', 'Oregon'])
df1
df2
df1 + df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

#### 在算术方法中填充值

In [53]:
df1 = pd.DataFrame(np.arange(12.).reshape((3, 4)), columns=list('abcd'))
df2 = pd.DataFrame(np.arange(20.).reshape((4, 5)), columns=list('abcde'))
# df2.loc[1, 'b'] = np.nan
df1
df2
df1 + df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0  11.0  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [54]:
# 使用add方法，以及fill_value参数，当没有值的时候填充。
df1.add(df2, fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0  11.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [59]:
# 使用除法
1 / df1
df1.rdiv(1)

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [60]:
# 使用reindex也可以指定填充值
df1.reindex(columns=df2.columns, fill_value=0)

     a    b     c     d  e
0  0.0  1.0   2.0   3.0  0
1  4.0  5.0   6.0   7.0  0
2  8.0  9.0  10.0  11.0  0

### DataFrame和Series之间的运算

In [65]:
# 二维数组与其中某行之间的差
arr = np.arange(12.).reshape((3, 4))
arr
arr[0]
arr - arr[0]

array([[ 0.,  0.,  0.,  0.],
       [ 4.,  4.,  4.,  4.],
       [ 8.,  8.,  8.,  8.]])

In [68]:
# 计算DataFrame和Series之间算术运算将Series的索引匹配到DataFrame的列，然后沿着行一直向下广播。
frame = pd.DataFrame(np.arange(12.).reshape((4, 3)),
                     columns=list('bde'),
                     index=['Utah', 'Ohio', 'Texas', 'Oregon'])
series = frame.iloc[0]
frame
series
frame - series

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

In [76]:
# 如果某个索引值在DataFrame的列和Series的索引中找不到，则参与运算的2个对象会被重新索引形成并集。
series2 = pd.Series(range(3), index=['b', 'e', 'f'])
series2
frame
frame + series2

          b   d     e   f
Utah    0.0 NaN   3.0 NaN
Ohio    3.0 NaN   6.0 NaN
Texas   6.0 NaN   9.0 NaN
Oregon  9.0 NaN  12.0 NaN

In [78]:
# 如果想匹配行在列上广播，则必须使用算术运算方法。 add sub div mul = + - * /
series3 = frame['d']
frame
series3
# 设定需要匹配的是行还是列
frame.sub(series3, axis='index')

          b    d    e
Utah   -1.0  0.0  1.0
Ohio   -1.0  0.0  1.0
Texas  -1.0  0.0  1.0
Oregon -1.0  0.0  1.0

### 函数应用和映射

In [79]:
# numpy的ufuncs（元素级数组方法）也可以用于操作pandas对象
frame = pd.DataFrame(np.random.randn(4, 3), columns=list('bde'),
                     index=['Utah', 'Ohio', 'Texas', 'Oregon'])
frame
np.abs(frame)

               b         d         e
Utah    0.773976  1.718358  0.789732
Ohio    1.758510  0.126481  0.498928
Texas   0.573846  0.983845  1.017182
Oregon  0.331466  0.136494  0.073973

In [80]:
# 将函数应用到由各行或列所形成的一维数组上。
f = lambda x: x.max() - x.min()
frame.apply(f)

b    2.532486
d    2.702204
e    1.516110
dtype: float64

In [81]:
# 选择列
frame.apply(f, axis='columns')

Utah      2.492334
Ohio      2.257438
Texas     2.001027
Oregon    0.467960
dtype: float64

In [82]:
# 还可以返回多个值组成的Series
def f(x):
    return pd.Series([x.min(), x.max()], index=['min', 'max'])
frame.apply(f)

            b         d         e
min -1.758510 -1.718358 -1.017182
max  0.773976  0.983845  0.498928

In [83]:
# 可以使用元素级的python函数
format = lambda x: '%.2f' % x
frame.applymap(format)

            b      d      e
Utah     0.77  -1.72  -0.79
Ohio    -1.76  -0.13   0.50
Texas    0.57   0.98  -1.02
Oregon  -0.33   0.14  -0.07

In [86]:
# 上面叫applymap是因为Series有个用于应用元素级函数的map方法
frame['e'].map(format)

Utah      -0.79
Ohio       0.50
Texas     -1.02
Oregon    -0.07
Name: e, dtype: object

### 排序和排名

In [88]:
# 返回一个排好序的新对象
obj = pd.Series(range(4), index=['d', 'a', 'b', 'c'])
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int32

In [90]:
# DataFrame选择任何一个轴上排序
frame = pd.DataFrame(np.arange(8).reshape((2, 4)),
                     index=['three', 'one'],
                     columns=['d', 'a', 'b', 'c'])
frame.sort_index()
# 默认是升序，也可以使用降序
frame.sort_index(axis=1, ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [92]:
# 按值对Series排序，任何缺失值默认都放在Series末尾
obj = pd.Series([4, 7, -3, 2])
obj.sort_values()
obj = pd.Series([4, np.nan, 7, np.nan, -3, 2])
obj.sort_values()

4   -3.0
5    2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

In [93]:
# DataFrame可以根据多列排序
frame = pd.DataFrame({'b': [4, 7, -3, 2], 'a': [0, 1, 0, 1]})
frame
frame.sort_values(by='b')
frame.sort_values(by=['a', 'b'])

   a  b
2  0 -3
0  0  4
3  1  2
1  1  7

In [94]:
# 计算数据的排名，默认情况下rank通过为各组分配一个平均排名来破坏平级关系。
obj = pd.Series([7, -5, 7, 4, 2, 0, 4])
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [95]:
# 给定排序函数，按照出现的顺序。
obj.rank(method='first')

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

#### method选项
average  ： 默认：在相等分组中，为每个值分配平均排名  
min  ： 使用整个分组的最小排名  
max  ： 使用整个分组的最大排名  
first  ： 按照出现顺序分配排序

In [102]:
# 降序进行排名。
obj.rank(ascending=False, method='min')

0    1.0
1    7.0
2    1.0
3    3.0
4    5.0
5    6.0
6    3.0
dtype: float64

In [104]:
# DataFrame的排名
frame = pd.DataFrame({'b': [4.3, 7, -3, 2], 'a': [0, 1, 0, 1], 'c': [-2, 5, 8, -2.5]})
frame
frame.rank(axis='columns')

     a    b    c
0  2.0  3.0  1.0
1  1.0  3.0  2.0
2  2.0  1.0  3.0
3  2.0  3.0  1.0

### 带有重复值的轴索引

In [106]:
# 前面介绍的所有范例都是带有唯一索引值的，下面我们来看看重复索引值的Series
obj = pd.Series(range(5), index=['a', 'a', 'b', 'b', 'c'])
obj
obj.index.is_unique

False

In [108]:
# 如果有重复索引会返回多个值
obj['a']

a    0
a    1
dtype: int32

In [109]:
df = pd.DataFrame(np.random.randn(4, 3), index=['a', 'a', 'b', 'b'])
df
df.loc['b']

          0         1         2
b -0.820998 -1.746303  0.892009
b  1.330135  1.794705  0.928346

### 汇总和计算描述统计

In [112]:
# pandas对象有一组常用的数学和统计方法
df = pd.DataFrame([[1.4, np.nan], [7.1, -4.5],
                   [np.nan, np.nan], [0.75, -1.3]],
                  index=['a', 'b', 'c', 'd'],
                  columns=['one', 'two'])
df
df.sum()
df.sum(axis='columns')
# 默认NA值自动被排除，可以使用skipna禁用该功能
df.mean(axis='columns', skipna=False)

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [115]:
# idxmin、idxmax 达到最小值、最大值的索引
df.idxmax()

one    b
two    d
dtype: object

In [117]:
# 累加
df.cumsum()
# 一次性产生多个汇总统计
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [118]:
# Series产生不同的汇总结果
obj = pd.Series(['a', 'a', 'b', 'c'] * 4)
obj.describe()

count     16
unique     3
top        a
freq       8
dtype: object

#### 描述和汇总统计
<table align = left>
  <tr>
    <th>函数</th>
    <th>说明</th>
  </tr>
  <tr>
    <td> count </td>
    <td> 非NA值的数量 </td>
  </tr>
  <tr>
    <td> describe </td>
    <td> 针对Series或各DataFrame列计算汇总统计 </td>
  </tr>
  <tr>
    <td> min、max </td>
    <td> 计算最小值和最大值 </td>
  </tr>
  <tr>
    <td> argmin、argmax </td>
    <td> 计算能够获取到最小值和最大值的索引位置（整数) </td>
  </tr>
  <tr>
    <td> idxmin、idxmax </td>
    <td> 计算能够获取到最小值和最大值的索引值 </td>
  </tr>
  <tr>
    <td> quantile </td>
    <td> 计算样本的分位数（0到1） </td>
  </tr>
  <tr>
    <td> sum </td>
    <td> 值的总和 </td>
  </tr>
  <tr>
    <td> mean </td>
    <td> 值的平均数，a.mean() </td>
  </tr>
  <tr>
    <td> media </td>
    <td> 值的算术中位数（50%分位数) </td>
  </tr>
  <tr>
    <td> mad </td>
    <td> 根据平均值计算平均绝对离差 </td>
  </tr>
  <tr>
    <td> var </td>
    <td> 样本值的方差 </td>
  </tr>
  <tr>
    <td> std </td>
    <td> 样本值的标准差 </td>
  </tr>
  <tr>
    <td> skew </td>
    <td> 样本值的偏度（三阶矩） </td>
  </tr>
  <tr>
    <td> kurt </td>
    <td> 样本值的峰度（四阶矩） </td>
  </tr>
  <tr>
    <td> cumsum </td>
    <td> 样本值的累计和 </td>
  </tr>
  <tr>
    <td> cummin,cummax </td>
    <td> 样本值的累计最大值和累计最小 </td>
  </tr>
  <tr>
    <td> cumprod </td>
    <td> 样本值的累计积 </td>
  </tr>
  <tr>
    <td> diff </td>
    <td> 计算一阶差分（对时间序列很有用) </td>
  </tr>
  <tr>
    <td> pct_change </td>
    <td> 计算百分数变化 </td>
  </tr>
</table>

### 相关系数与协方差